models/Company.php

    public static function compid()
    {

        $user_id = Yii::$app->user->identity->id;

        $data = UserCompany::find()->where(['user_id'=>$user_id])->one();
---
SELECT * FROM `user_company` WHERE `user_id`=206