models/Notification.php

    public static function notify()
    {


        $user = User::find()->where(['id'=>Yii::$app->user->identity->id])->one();
---
SELECT * FROM `user` WHERE `id`=206

    public static function listnotify()
    {


        $user = User::find()->where(['id'=>Yii::$app->user->identity->id])->one();
---
SELECT * FROM `user` WHERE `id`=206